---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsLayoutParam
source: html/6409d75e-6881-f7ae-6043-ce388439d1ec.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsLayoutParam Property

"Layout"

## Syntax (C#)
```csharp
public static ForgeTypeId HandrailSupportsLayoutParam { get; }
```